7767517
1827 2238
Input            input                    0 1 input
Convolution      /Conv                    1 1 input /Conv_output_0 0=64 1=3 4=1 5=1 6=1728
Split            splitncnn_0              1 4 /Conv_output_0 /Conv_output_0_splitncnn_0 /Conv_output_0_splitncnn_1 /Conv_output_0_splitncnn_2 /Conv_output_0_splitncnn_3
Convolution      /Conv_1                  1 1 /Conv_output_0_splitncnn_3 /Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_2                  1 1 /Relu_output_0 /Conv_2_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_1              1 2 /Conv_2_output_0 /Conv_2_output_0_splitncnn_0 /Conv_2_output_0_splitncnn_1
Pooling          /GlobalAveragePool       1 1 /Conv_2_output_0_splitncnn_1 /GlobalAveragePool_output_0 0=1 4=1
InnerProduct     /Conv_3                  1 1 /GlobalAveragePool_output_0 /Relu_1_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_4                  1 1 /Relu_1_output_0 /Sigmoid_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_1                   2 1 /Conv_2_output_0_splitncnn_0 /Sigmoid_output_0 /Mul_1_output_0 0=2
BinaryOp         /Add                     2 1 /Mul_1_output_0 /Conv_output_0_splitncnn_2 /Add_output_0
Split            splitncnn_2              1 2 /Add_output_0 /Add_output_0_splitncnn_0 /Add_output_0_splitncnn_1
Convolution      /Conv_5                  1 1 /Add_output_0_splitncnn_1 /Relu_2_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_6                  1 1 /Relu_2_output_0 /Conv_6_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_3              1 2 /Conv_6_output_0 /Conv_6_output_0_splitncnn_0 /Conv_6_output_0_splitncnn_1
Pooling          /GlobalAveragePool_1     1 1 /Conv_6_output_0_splitncnn_1 /GlobalAveragePool_1_output_0 0=1 4=1
InnerProduct     /Conv_7                  1 1 /GlobalAveragePool_1_output_0 /Relu_3_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_8                  1 1 /Relu_3_output_0 /Sigmoid_1_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_2                   2 1 /Conv_6_output_0_splitncnn_0 /Sigmoid_1_output_0 /Mul_2_output_0 0=2
BinaryOp         /Add_1                   2 1 /Mul_2_output_0 /Add_output_0_splitncnn_0 /Add_1_output_0
Split            splitncnn_4              1 2 /Add_1_output_0 /Add_1_output_0_splitncnn_0 /Add_1_output_0_splitncnn_1
Convolution      /Conv_9                  1 1 /Add_1_output_0_splitncnn_1 /Relu_4_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_10                 1 1 /Relu_4_output_0 /Conv_10_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_5              1 2 /Conv_10_output_0 /Conv_10_output_0_splitncnn_0 /Conv_10_output_0_splitncnn_1
Pooling          /GlobalAveragePool_2     1 1 /Conv_10_output_0_splitncnn_1 /GlobalAveragePool_2_output_0 0=1 4=1
InnerProduct     /Conv_11                 1 1 /GlobalAveragePool_2_output_0 /Relu_5_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_12                 1 1 /Relu_5_output_0 /Sigmoid_2_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_3                   2 1 /Conv_10_output_0_splitncnn_0 /Sigmoid_2_output_0 /Mul_3_output_0 0=2
BinaryOp         /Add_2                   2 1 /Mul_3_output_0 /Add_1_output_0_splitncnn_0 /Add_2_output_0
Split            splitncnn_6              1 2 /Add_2_output_0 /Add_2_output_0_splitncnn_0 /Add_2_output_0_splitncnn_1
Convolution      /Conv_13                 1 1 /Add_2_output_0_splitncnn_1 /Relu_6_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_14                 1 1 /Relu_6_output_0 /Conv_14_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_7              1 2 /Conv_14_output_0 /Conv_14_output_0_splitncnn_0 /Conv_14_output_0_splitncnn_1
Pooling          /GlobalAveragePool_3     1 1 /Conv_14_output_0_splitncnn_1 /GlobalAveragePool_3_output_0 0=1 4=1
InnerProduct     /Conv_15                 1 1 /GlobalAveragePool_3_output_0 /Relu_7_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_16                 1 1 /Relu_7_output_0 /Sigmoid_3_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_4                   2 1 /Conv_14_output_0_splitncnn_0 /Sigmoid_3_output_0 /Mul_4_output_0 0=2
BinaryOp         /Add_3                   2 1 /Mul_4_output_0 /Add_2_output_0_splitncnn_0 /Add_3_output_0
Split            splitncnn_8              1 2 /Add_3_output_0 /Add_3_output_0_splitncnn_0 /Add_3_output_0_splitncnn_1
Convolution      /Conv_17                 1 1 /Add_3_output_0_splitncnn_1 /Relu_8_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_18                 1 1 /Relu_8_output_0 /Conv_18_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_9              1 2 /Conv_18_output_0 /Conv_18_output_0_splitncnn_0 /Conv_18_output_0_splitncnn_1
Pooling          /GlobalAveragePool_4     1 1 /Conv_18_output_0_splitncnn_1 /GlobalAveragePool_4_output_0 0=1 4=1
InnerProduct     /Conv_19                 1 1 /GlobalAveragePool_4_output_0 /Relu_9_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_20                 1 1 /Relu_9_output_0 /Sigmoid_4_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_5                   2 1 /Conv_18_output_0_splitncnn_0 /Sigmoid_4_output_0 /Mul_5_output_0 0=2
BinaryOp         /Add_4                   2 1 /Mul_5_output_0 /Add_3_output_0_splitncnn_0 /Add_4_output_0
Split            splitncnn_10             1 2 /Add_4_output_0 /Add_4_output_0_splitncnn_0 /Add_4_output_0_splitncnn_1
Convolution      /Conv_21                 1 1 /Add_4_output_0_splitncnn_1 /Relu_10_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_22                 1 1 /Relu_10_output_0 /Conv_22_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_11             1 2 /Conv_22_output_0 /Conv_22_output_0_splitncnn_0 /Conv_22_output_0_splitncnn_1
Pooling          /GlobalAveragePool_5     1 1 /Conv_22_output_0_splitncnn_1 /GlobalAveragePool_5_output_0 0=1 4=1
InnerProduct     /Conv_23                 1 1 /GlobalAveragePool_5_output_0 /Relu_11_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_24                 1 1 /Relu_11_output_0 /Sigmoid_5_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_6                   2 1 /Conv_22_output_0_splitncnn_0 /Sigmoid_5_output_0 /Mul_6_output_0 0=2
BinaryOp         /Add_5                   2 1 /Mul_6_output_0 /Add_4_output_0_splitncnn_0 /Add_5_output_0
Split            splitncnn_12             1 2 /Add_5_output_0 /Add_5_output_0_splitncnn_0 /Add_5_output_0_splitncnn_1
Convolution      /Conv_25                 1 1 /Add_5_output_0_splitncnn_1 /Relu_12_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_26                 1 1 /Relu_12_output_0 /Conv_26_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_13             1 2 /Conv_26_output_0 /Conv_26_output_0_splitncnn_0 /Conv_26_output_0_splitncnn_1
Pooling          /GlobalAveragePool_6     1 1 /Conv_26_output_0_splitncnn_1 /GlobalAveragePool_6_output_0 0=1 4=1
InnerProduct     /Conv_27                 1 1 /GlobalAveragePool_6_output_0 /Relu_13_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_28                 1 1 /Relu_13_output_0 /Sigmoid_6_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_7                   2 1 /Conv_26_output_0_splitncnn_0 /Sigmoid_6_output_0 /Mul_7_output_0 0=2
BinaryOp         /Add_6                   2 1 /Mul_7_output_0 /Add_5_output_0_splitncnn_0 /Add_6_output_0
Split            splitncnn_14             1 2 /Add_6_output_0 /Add_6_output_0_splitncnn_0 /Add_6_output_0_splitncnn_1
Convolution      /Conv_29                 1 1 /Add_6_output_0_splitncnn_1 /Relu_14_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_30                 1 1 /Relu_14_output_0 /Conv_30_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_15             1 2 /Conv_30_output_0 /Conv_30_output_0_splitncnn_0 /Conv_30_output_0_splitncnn_1
Pooling          /GlobalAveragePool_7     1 1 /Conv_30_output_0_splitncnn_1 /GlobalAveragePool_7_output_0 0=1 4=1
InnerProduct     /Conv_31                 1 1 /GlobalAveragePool_7_output_0 /Relu_15_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_32                 1 1 /Relu_15_output_0 /Sigmoid_7_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_8                   2 1 /Conv_30_output_0_splitncnn_0 /Sigmoid_7_output_0 /Mul_8_output_0 0=2
BinaryOp         /Add_7                   2 1 /Mul_8_output_0 /Add_6_output_0_splitncnn_0 /Add_7_output_0
Split            splitncnn_16             1 2 /Add_7_output_0 /Add_7_output_0_splitncnn_0 /Add_7_output_0_splitncnn_1
Convolution      /Conv_33                 1 1 /Add_7_output_0_splitncnn_1 /Relu_16_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_34                 1 1 /Relu_16_output_0 /Conv_34_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_17             1 2 /Conv_34_output_0 /Conv_34_output_0_splitncnn_0 /Conv_34_output_0_splitncnn_1
Pooling          /GlobalAveragePool_8     1 1 /Conv_34_output_0_splitncnn_1 /GlobalAveragePool_8_output_0 0=1 4=1
InnerProduct     /Conv_35                 1 1 /GlobalAveragePool_8_output_0 /Relu_17_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_36                 1 1 /Relu_17_output_0 /Sigmoid_8_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_9                   2 1 /Conv_34_output_0_splitncnn_0 /Sigmoid_8_output_0 /Mul_9_output_0 0=2
BinaryOp         /Add_8                   2 1 /Mul_9_output_0 /Add_7_output_0_splitncnn_0 /Add_8_output_0
Split            splitncnn_18             1 2 /Add_8_output_0 /Add_8_output_0_splitncnn_0 /Add_8_output_0_splitncnn_1
Convolution      /Conv_37                 1 1 /Add_8_output_0_splitncnn_1 /Relu_18_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_38                 1 1 /Relu_18_output_0 /Conv_38_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_19             1 2 /Conv_38_output_0 /Conv_38_output_0_splitncnn_0 /Conv_38_output_0_splitncnn_1
Pooling          /GlobalAveragePool_9     1 1 /Conv_38_output_0_splitncnn_1 /GlobalAveragePool_9_output_0 0=1 4=1
InnerProduct     /Conv_39                 1 1 /GlobalAveragePool_9_output_0 /Relu_19_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_40                 1 1 /Relu_19_output_0 /Sigmoid_9_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_10                  2 1 /Conv_38_output_0_splitncnn_0 /Sigmoid_9_output_0 /Mul_10_output_0 0=2
BinaryOp         /Add_9                   2 1 /Mul_10_output_0 /Add_8_output_0_splitncnn_0 /Add_9_output_0
Split            splitncnn_20             1 2 /Add_9_output_0 /Add_9_output_0_splitncnn_0 /Add_9_output_0_splitncnn_1
Convolution      /Conv_41                 1 1 /Add_9_output_0_splitncnn_1 /Relu_20_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_42                 1 1 /Relu_20_output_0 /Conv_42_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_21             1 2 /Conv_42_output_0 /Conv_42_output_0_splitncnn_0 /Conv_42_output_0_splitncnn_1
Pooling          /GlobalAveragePool_10    1 1 /Conv_42_output_0_splitncnn_1 /GlobalAveragePool_10_output_0 0=1 4=1
InnerProduct     /Conv_43                 1 1 /GlobalAveragePool_10_output_0 /Relu_21_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_44                 1 1 /Relu_21_output_0 /Sigmoid_10_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_11                  2 1 /Conv_42_output_0_splitncnn_0 /Sigmoid_10_output_0 /Mul_11_output_0 0=2
BinaryOp         /Add_10                  2 1 /Mul_11_output_0 /Add_9_output_0_splitncnn_0 /Add_10_output_0
Split            splitncnn_22             1 2 /Add_10_output_0 /Add_10_output_0_splitncnn_0 /Add_10_output_0_splitncnn_1
Convolution      /Conv_45                 1 1 /Add_10_output_0_splitncnn_1 /Relu_22_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_46                 1 1 /Relu_22_output_0 /Conv_46_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_23             1 2 /Conv_46_output_0 /Conv_46_output_0_splitncnn_0 /Conv_46_output_0_splitncnn_1
Pooling          /GlobalAveragePool_11    1 1 /Conv_46_output_0_splitncnn_1 /GlobalAveragePool_11_output_0 0=1 4=1
InnerProduct     /Conv_47                 1 1 /GlobalAveragePool_11_output_0 /Relu_23_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_48                 1 1 /Relu_23_output_0 /Sigmoid_11_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_12                  2 1 /Conv_46_output_0_splitncnn_0 /Sigmoid_11_output_0 /Mul_12_output_0 0=2
BinaryOp         /Add_11                  2 1 /Mul_12_output_0 /Add_10_output_0_splitncnn_0 /Add_11_output_0
Split            splitncnn_24             1 2 /Add_11_output_0 /Add_11_output_0_splitncnn_0 /Add_11_output_0_splitncnn_1
Convolution      /Conv_49                 1 1 /Add_11_output_0_splitncnn_1 /Relu_24_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_50                 1 1 /Relu_24_output_0 /Conv_50_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_25             1 2 /Conv_50_output_0 /Conv_50_output_0_splitncnn_0 /Conv_50_output_0_splitncnn_1
Pooling          /GlobalAveragePool_12    1 1 /Conv_50_output_0_splitncnn_1 /GlobalAveragePool_12_output_0 0=1 4=1
InnerProduct     /Conv_51                 1 1 /GlobalAveragePool_12_output_0 /Relu_25_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_52                 1 1 /Relu_25_output_0 /Sigmoid_12_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_13                  2 1 /Conv_50_output_0_splitncnn_0 /Sigmoid_12_output_0 /Mul_13_output_0 0=2
BinaryOp         /Add_12                  2 1 /Mul_13_output_0 /Add_11_output_0_splitncnn_0 /Add_12_output_0
Split            splitncnn_26             1 2 /Add_12_output_0 /Add_12_output_0_splitncnn_0 /Add_12_output_0_splitncnn_1
Convolution      /Conv_53                 1 1 /Add_12_output_0_splitncnn_1 /Relu_26_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_54                 1 1 /Relu_26_output_0 /Conv_54_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_27             1 2 /Conv_54_output_0 /Conv_54_output_0_splitncnn_0 /Conv_54_output_0_splitncnn_1
Pooling          /GlobalAveragePool_13    1 1 /Conv_54_output_0_splitncnn_1 /GlobalAveragePool_13_output_0 0=1 4=1
InnerProduct     /Conv_55                 1 1 /GlobalAveragePool_13_output_0 /Relu_27_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_56                 1 1 /Relu_27_output_0 /Sigmoid_13_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_14                  2 1 /Conv_54_output_0_splitncnn_0 /Sigmoid_13_output_0 /Mul_14_output_0 0=2
BinaryOp         /Add_13                  2 1 /Mul_14_output_0 /Add_12_output_0_splitncnn_0 /Add_13_output_0
Split            splitncnn_28             1 2 /Add_13_output_0 /Add_13_output_0_splitncnn_0 /Add_13_output_0_splitncnn_1
Convolution      /Conv_57                 1 1 /Add_13_output_0_splitncnn_1 /Relu_28_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_58                 1 1 /Relu_28_output_0 /Conv_58_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_29             1 2 /Conv_58_output_0 /Conv_58_output_0_splitncnn_0 /Conv_58_output_0_splitncnn_1
Pooling          /GlobalAveragePool_14    1 1 /Conv_58_output_0_splitncnn_1 /GlobalAveragePool_14_output_0 0=1 4=1
InnerProduct     /Conv_59                 1 1 /GlobalAveragePool_14_output_0 /Relu_29_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_60                 1 1 /Relu_29_output_0 /Sigmoid_14_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_15                  2 1 /Conv_58_output_0_splitncnn_0 /Sigmoid_14_output_0 /Mul_15_output_0 0=2
BinaryOp         /Add_14                  2 1 /Mul_15_output_0 /Add_13_output_0_splitncnn_0 /Add_14_output_0
Split            splitncnn_30             1 2 /Add_14_output_0 /Add_14_output_0_splitncnn_0 /Add_14_output_0_splitncnn_1
Convolution      /Conv_61                 1 1 /Add_14_output_0_splitncnn_1 /Relu_30_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_62                 1 1 /Relu_30_output_0 /Conv_62_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_31             1 2 /Conv_62_output_0 /Conv_62_output_0_splitncnn_0 /Conv_62_output_0_splitncnn_1
Pooling          /GlobalAveragePool_15    1 1 /Conv_62_output_0_splitncnn_1 /GlobalAveragePool_15_output_0 0=1 4=1
InnerProduct     /Conv_63                 1 1 /GlobalAveragePool_15_output_0 /Relu_31_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_64                 1 1 /Relu_31_output_0 /Sigmoid_15_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_16                  2 1 /Conv_62_output_0_splitncnn_0 /Sigmoid_15_output_0 /Mul_16_output_0 0=2
BinaryOp         /Add_15                  2 1 /Mul_16_output_0 /Add_14_output_0_splitncnn_0 /Add_15_output_0
Split            splitncnn_32             1 2 /Add_15_output_0 /Add_15_output_0_splitncnn_0 /Add_15_output_0_splitncnn_1
Convolution      /Conv_65                 1 1 /Add_15_output_0_splitncnn_1 /Relu_32_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_66                 1 1 /Relu_32_output_0 /Conv_66_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_33             1 2 /Conv_66_output_0 /Conv_66_output_0_splitncnn_0 /Conv_66_output_0_splitncnn_1
Pooling          /GlobalAveragePool_16    1 1 /Conv_66_output_0_splitncnn_1 /GlobalAveragePool_16_output_0 0=1 4=1
InnerProduct     /Conv_67                 1 1 /GlobalAveragePool_16_output_0 /Relu_33_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_68                 1 1 /Relu_33_output_0 /Sigmoid_16_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_17                  2 1 /Conv_66_output_0_splitncnn_0 /Sigmoid_16_output_0 /Mul_17_output_0 0=2
BinaryOp         /Add_16                  2 1 /Mul_17_output_0 /Add_15_output_0_splitncnn_0 /Add_16_output_0
Split            splitncnn_34             1 2 /Add_16_output_0 /Add_16_output_0_splitncnn_0 /Add_16_output_0_splitncnn_1
Convolution      /Conv_69                 1 1 /Add_16_output_0_splitncnn_1 /Relu_34_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_70                 1 1 /Relu_34_output_0 /Conv_70_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_35             1 2 /Conv_70_output_0 /Conv_70_output_0_splitncnn_0 /Conv_70_output_0_splitncnn_1
Pooling          /GlobalAveragePool_17    1 1 /Conv_70_output_0_splitncnn_1 /GlobalAveragePool_17_output_0 0=1 4=1
InnerProduct     /Conv_71                 1 1 /GlobalAveragePool_17_output_0 /Relu_35_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_72                 1 1 /Relu_35_output_0 /Sigmoid_17_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_18                  2 1 /Conv_70_output_0_splitncnn_0 /Sigmoid_17_output_0 /Mul_18_output_0 0=2
BinaryOp         /Add_17                  2 1 /Mul_18_output_0 /Add_16_output_0_splitncnn_0 /Add_17_output_0
Split            splitncnn_36             1 2 /Add_17_output_0 /Add_17_output_0_splitncnn_0 /Add_17_output_0_splitncnn_1
Convolution      /Conv_73                 1 1 /Add_17_output_0_splitncnn_1 /Relu_36_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_74                 1 1 /Relu_36_output_0 /Conv_74_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_37             1 2 /Conv_74_output_0 /Conv_74_output_0_splitncnn_0 /Conv_74_output_0_splitncnn_1
Pooling          /GlobalAveragePool_18    1 1 /Conv_74_output_0_splitncnn_1 /GlobalAveragePool_18_output_0 0=1 4=1
InnerProduct     /Conv_75                 1 1 /GlobalAveragePool_18_output_0 /Relu_37_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_76                 1 1 /Relu_37_output_0 /Sigmoid_18_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_19                  2 1 /Conv_74_output_0_splitncnn_0 /Sigmoid_18_output_0 /Mul_19_output_0 0=2
BinaryOp         /Add_18                  2 1 /Mul_19_output_0 /Add_17_output_0_splitncnn_0 /Add_18_output_0
Split            splitncnn_38             1 2 /Add_18_output_0 /Add_18_output_0_splitncnn_0 /Add_18_output_0_splitncnn_1
Convolution      /Conv_77                 1 1 /Add_18_output_0_splitncnn_1 /Relu_38_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_78                 1 1 /Relu_38_output_0 /Conv_78_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_39             1 2 /Conv_78_output_0 /Conv_78_output_0_splitncnn_0 /Conv_78_output_0_splitncnn_1
Pooling          /GlobalAveragePool_19    1 1 /Conv_78_output_0_splitncnn_1 /GlobalAveragePool_19_output_0 0=1 4=1
InnerProduct     /Conv_79                 1 1 /GlobalAveragePool_19_output_0 /Relu_39_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_80                 1 1 /Relu_39_output_0 /Sigmoid_19_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_20                  2 1 /Conv_78_output_0_splitncnn_0 /Sigmoid_19_output_0 /Mul_20_output_0 0=2
BinaryOp         /Add_19                  2 1 /Mul_20_output_0 /Add_18_output_0_splitncnn_0 /Add_19_output_0
Convolution      /Conv_81                 1 1 /Add_19_output_0 /Conv_81_output_0 0=64 1=3 4=1 5=1 6=36864
BinaryOp         /Add_20                  2 1 /Conv_81_output_0 /Conv_output_0_splitncnn_1 /Add_20_output_0
Split            splitncnn_40             1 3 /Add_20_output_0 /Add_20_output_0_splitncnn_0 /Add_20_output_0_splitncnn_1 /Add_20_output_0_splitncnn_2
Convolution      /Conv_82                 1 1 /Add_20_output_0_splitncnn_2 /Relu_40_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_83                 1 1 /Relu_40_output_0 /Conv_83_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_41             1 2 /Conv_83_output_0 /Conv_83_output_0_splitncnn_0 /Conv_83_output_0_splitncnn_1
Pooling          /GlobalAveragePool_20    1 1 /Conv_83_output_0_splitncnn_1 /GlobalAveragePool_20_output_0 0=1 4=1
InnerProduct     /Conv_84                 1 1 /GlobalAveragePool_20_output_0 /Relu_41_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_85                 1 1 /Relu_41_output_0 /Sigmoid_20_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_21                  2 1 /Conv_83_output_0_splitncnn_0 /Sigmoid_20_output_0 /Mul_21_output_0 0=2
BinaryOp         /Add_21                  2 1 /Mul_21_output_0 /Add_20_output_0_splitncnn_1 /Add_21_output_0
Split            splitncnn_42             1 2 /Add_21_output_0 /Add_21_output_0_splitncnn_0 /Add_21_output_0_splitncnn_1
Convolution      /Conv_86                 1 1 /Add_21_output_0_splitncnn_1 /Relu_42_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_87                 1 1 /Relu_42_output_0 /Conv_87_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_43             1 2 /Conv_87_output_0 /Conv_87_output_0_splitncnn_0 /Conv_87_output_0_splitncnn_1
Pooling          /GlobalAveragePool_21    1 1 /Conv_87_output_0_splitncnn_1 /GlobalAveragePool_21_output_0 0=1 4=1
InnerProduct     /Conv_88                 1 1 /GlobalAveragePool_21_output_0 /Relu_43_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_89                 1 1 /Relu_43_output_0 /Sigmoid_21_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_22                  2 1 /Conv_87_output_0_splitncnn_0 /Sigmoid_21_output_0 /Mul_22_output_0 0=2
BinaryOp         /Add_22                  2 1 /Mul_22_output_0 /Add_21_output_0_splitncnn_0 /Add_22_output_0
Split            splitncnn_44             1 2 /Add_22_output_0 /Add_22_output_0_splitncnn_0 /Add_22_output_0_splitncnn_1
Convolution      /Conv_90                 1 1 /Add_22_output_0_splitncnn_1 /Relu_44_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_91                 1 1 /Relu_44_output_0 /Conv_91_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_45             1 2 /Conv_91_output_0 /Conv_91_output_0_splitncnn_0 /Conv_91_output_0_splitncnn_1
Pooling          /GlobalAveragePool_22    1 1 /Conv_91_output_0_splitncnn_1 /GlobalAveragePool_22_output_0 0=1 4=1
InnerProduct     /Conv_92                 1 1 /GlobalAveragePool_22_output_0 /Relu_45_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_93                 1 1 /Relu_45_output_0 /Sigmoid_22_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_23                  2 1 /Conv_91_output_0_splitncnn_0 /Sigmoid_22_output_0 /Mul_23_output_0 0=2
BinaryOp         /Add_23                  2 1 /Mul_23_output_0 /Add_22_output_0_splitncnn_0 /Add_23_output_0
Split            splitncnn_46             1 2 /Add_23_output_0 /Add_23_output_0_splitncnn_0 /Add_23_output_0_splitncnn_1
Convolution      /Conv_94                 1 1 /Add_23_output_0_splitncnn_1 /Relu_46_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_95                 1 1 /Relu_46_output_0 /Conv_95_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_47             1 2 /Conv_95_output_0 /Conv_95_output_0_splitncnn_0 /Conv_95_output_0_splitncnn_1
Pooling          /GlobalAveragePool_23    1 1 /Conv_95_output_0_splitncnn_1 /GlobalAveragePool_23_output_0 0=1 4=1
InnerProduct     /Conv_96                 1 1 /GlobalAveragePool_23_output_0 /Relu_47_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_97                 1 1 /Relu_47_output_0 /Sigmoid_23_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_24                  2 1 /Conv_95_output_0_splitncnn_0 /Sigmoid_23_output_0 /Mul_24_output_0 0=2
BinaryOp         /Add_24                  2 1 /Mul_24_output_0 /Add_23_output_0_splitncnn_0 /Add_24_output_0
Split            splitncnn_48             1 2 /Add_24_output_0 /Add_24_output_0_splitncnn_0 /Add_24_output_0_splitncnn_1
Convolution      /Conv_98                 1 1 /Add_24_output_0_splitncnn_1 /Relu_48_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_99                 1 1 /Relu_48_output_0 /Conv_99_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_49             1 2 /Conv_99_output_0 /Conv_99_output_0_splitncnn_0 /Conv_99_output_0_splitncnn_1
Pooling          /GlobalAveragePool_24    1 1 /Conv_99_output_0_splitncnn_1 /GlobalAveragePool_24_output_0 0=1 4=1
InnerProduct     /Conv_100                1 1 /GlobalAveragePool_24_output_0 /Relu_49_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_101                1 1 /Relu_49_output_0 /Sigmoid_24_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_25                  2 1 /Conv_99_output_0_splitncnn_0 /Sigmoid_24_output_0 /Mul_25_output_0 0=2
BinaryOp         /Add_25                  2 1 /Mul_25_output_0 /Add_24_output_0_splitncnn_0 /Add_25_output_0
Split            splitncnn_50             1 2 /Add_25_output_0 /Add_25_output_0_splitncnn_0 /Add_25_output_0_splitncnn_1
Convolution      /Conv_102                1 1 /Add_25_output_0_splitncnn_1 /Relu_50_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_103                1 1 /Relu_50_output_0 /Conv_103_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_51             1 2 /Conv_103_output_0 /Conv_103_output_0_splitncnn_0 /Conv_103_output_0_splitncnn_1
Pooling          /GlobalAveragePool_25    1 1 /Conv_103_output_0_splitncnn_1 /GlobalAveragePool_25_output_0 0=1 4=1
InnerProduct     /Conv_104                1 1 /GlobalAveragePool_25_output_0 /Relu_51_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_105                1 1 /Relu_51_output_0 /Sigmoid_25_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_26                  2 1 /Conv_103_output_0_splitncnn_0 /Sigmoid_25_output_0 /Mul_26_output_0 0=2
BinaryOp         /Add_26                  2 1 /Mul_26_output_0 /Add_25_output_0_splitncnn_0 /Add_26_output_0
Split            splitncnn_52             1 2 /Add_26_output_0 /Add_26_output_0_splitncnn_0 /Add_26_output_0_splitncnn_1
Convolution      /Conv_106                1 1 /Add_26_output_0_splitncnn_1 /Relu_52_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_107                1 1 /Relu_52_output_0 /Conv_107_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_53             1 2 /Conv_107_output_0 /Conv_107_output_0_splitncnn_0 /Conv_107_output_0_splitncnn_1
Pooling          /GlobalAveragePool_26    1 1 /Conv_107_output_0_splitncnn_1 /GlobalAveragePool_26_output_0 0=1 4=1
InnerProduct     /Conv_108                1 1 /GlobalAveragePool_26_output_0 /Relu_53_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_109                1 1 /Relu_53_output_0 /Sigmoid_26_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_27                  2 1 /Conv_107_output_0_splitncnn_0 /Sigmoid_26_output_0 /Mul_27_output_0 0=2
BinaryOp         /Add_27                  2 1 /Mul_27_output_0 /Add_26_output_0_splitncnn_0 /Add_27_output_0
Split            splitncnn_54             1 2 /Add_27_output_0 /Add_27_output_0_splitncnn_0 /Add_27_output_0_splitncnn_1
Convolution      /Conv_110                1 1 /Add_27_output_0_splitncnn_1 /Relu_54_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_111                1 1 /Relu_54_output_0 /Conv_111_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_55             1 2 /Conv_111_output_0 /Conv_111_output_0_splitncnn_0 /Conv_111_output_0_splitncnn_1
Pooling          /GlobalAveragePool_27    1 1 /Conv_111_output_0_splitncnn_1 /GlobalAveragePool_27_output_0 0=1 4=1
InnerProduct     /Conv_112                1 1 /GlobalAveragePool_27_output_0 /Relu_55_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_113                1 1 /Relu_55_output_0 /Sigmoid_27_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_28                  2 1 /Conv_111_output_0_splitncnn_0 /Sigmoid_27_output_0 /Mul_28_output_0 0=2
BinaryOp         /Add_28                  2 1 /Mul_28_output_0 /Add_27_output_0_splitncnn_0 /Add_28_output_0
Split            splitncnn_56             1 2 /Add_28_output_0 /Add_28_output_0_splitncnn_0 /Add_28_output_0_splitncnn_1
Convolution      /Conv_114                1 1 /Add_28_output_0_splitncnn_1 /Relu_56_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_115                1 1 /Relu_56_output_0 /Conv_115_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_57             1 2 /Conv_115_output_0 /Conv_115_output_0_splitncnn_0 /Conv_115_output_0_splitncnn_1
Pooling          /GlobalAveragePool_28    1 1 /Conv_115_output_0_splitncnn_1 /GlobalAveragePool_28_output_0 0=1 4=1
InnerProduct     /Conv_116                1 1 /GlobalAveragePool_28_output_0 /Relu_57_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_117                1 1 /Relu_57_output_0 /Sigmoid_28_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_29                  2 1 /Conv_115_output_0_splitncnn_0 /Sigmoid_28_output_0 /Mul_29_output_0 0=2
BinaryOp         /Add_29                  2 1 /Mul_29_output_0 /Add_28_output_0_splitncnn_0 /Add_29_output_0
Split            splitncnn_58             1 2 /Add_29_output_0 /Add_29_output_0_splitncnn_0 /Add_29_output_0_splitncnn_1
Convolution      /Conv_118                1 1 /Add_29_output_0_splitncnn_1 /Relu_58_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_119                1 1 /Relu_58_output_0 /Conv_119_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_59             1 2 /Conv_119_output_0 /Conv_119_output_0_splitncnn_0 /Conv_119_output_0_splitncnn_1
Pooling          /GlobalAveragePool_29    1 1 /Conv_119_output_0_splitncnn_1 /GlobalAveragePool_29_output_0 0=1 4=1
InnerProduct     /Conv_120                1 1 /GlobalAveragePool_29_output_0 /Relu_59_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_121                1 1 /Relu_59_output_0 /Sigmoid_29_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_30                  2 1 /Conv_119_output_0_splitncnn_0 /Sigmoid_29_output_0 /Mul_30_output_0 0=2
BinaryOp         /Add_30                  2 1 /Mul_30_output_0 /Add_29_output_0_splitncnn_0 /Add_30_output_0
Split            splitncnn_60             1 2 /Add_30_output_0 /Add_30_output_0_splitncnn_0 /Add_30_output_0_splitncnn_1
Convolution      /Conv_122                1 1 /Add_30_output_0_splitncnn_1 /Relu_60_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_123                1 1 /Relu_60_output_0 /Conv_123_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_61             1 2 /Conv_123_output_0 /Conv_123_output_0_splitncnn_0 /Conv_123_output_0_splitncnn_1
Pooling          /GlobalAveragePool_30    1 1 /Conv_123_output_0_splitncnn_1 /GlobalAveragePool_30_output_0 0=1 4=1
InnerProduct     /Conv_124                1 1 /GlobalAveragePool_30_output_0 /Relu_61_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_125                1 1 /Relu_61_output_0 /Sigmoid_30_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_31                  2 1 /Conv_123_output_0_splitncnn_0 /Sigmoid_30_output_0 /Mul_31_output_0 0=2
BinaryOp         /Add_31                  2 1 /Mul_31_output_0 /Add_30_output_0_splitncnn_0 /Add_31_output_0
Split            splitncnn_62             1 2 /Add_31_output_0 /Add_31_output_0_splitncnn_0 /Add_31_output_0_splitncnn_1
Convolution      /Conv_126                1 1 /Add_31_output_0_splitncnn_1 /Relu_62_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_127                1 1 /Relu_62_output_0 /Conv_127_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_63             1 2 /Conv_127_output_0 /Conv_127_output_0_splitncnn_0 /Conv_127_output_0_splitncnn_1
Pooling          /GlobalAveragePool_31    1 1 /Conv_127_output_0_splitncnn_1 /GlobalAveragePool_31_output_0 0=1 4=1
InnerProduct     /Conv_128                1 1 /GlobalAveragePool_31_output_0 /Relu_63_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_129                1 1 /Relu_63_output_0 /Sigmoid_31_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_32                  2 1 /Conv_127_output_0_splitncnn_0 /Sigmoid_31_output_0 /Mul_32_output_0 0=2
BinaryOp         /Add_32                  2 1 /Mul_32_output_0 /Add_31_output_0_splitncnn_0 /Add_32_output_0
Split            splitncnn_64             1 2 /Add_32_output_0 /Add_32_output_0_splitncnn_0 /Add_32_output_0_splitncnn_1
Convolution      /Conv_130                1 1 /Add_32_output_0_splitncnn_1 /Relu_64_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_131                1 1 /Relu_64_output_0 /Conv_131_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_65             1 2 /Conv_131_output_0 /Conv_131_output_0_splitncnn_0 /Conv_131_output_0_splitncnn_1
Pooling          /GlobalAveragePool_32    1 1 /Conv_131_output_0_splitncnn_1 /GlobalAveragePool_32_output_0 0=1 4=1
InnerProduct     /Conv_132                1 1 /GlobalAveragePool_32_output_0 /Relu_65_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_133                1 1 /Relu_65_output_0 /Sigmoid_32_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_33                  2 1 /Conv_131_output_0_splitncnn_0 /Sigmoid_32_output_0 /Mul_33_output_0 0=2
BinaryOp         /Add_33                  2 1 /Mul_33_output_0 /Add_32_output_0_splitncnn_0 /Add_33_output_0
Split            splitncnn_66             1 2 /Add_33_output_0 /Add_33_output_0_splitncnn_0 /Add_33_output_0_splitncnn_1
Convolution      /Conv_134                1 1 /Add_33_output_0_splitncnn_1 /Relu_66_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_135                1 1 /Relu_66_output_0 /Conv_135_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_67             1 2 /Conv_135_output_0 /Conv_135_output_0_splitncnn_0 /Conv_135_output_0_splitncnn_1
Pooling          /GlobalAveragePool_33    1 1 /Conv_135_output_0_splitncnn_1 /GlobalAveragePool_33_output_0 0=1 4=1
InnerProduct     /Conv_136                1 1 /GlobalAveragePool_33_output_0 /Relu_67_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_137                1 1 /Relu_67_output_0 /Sigmoid_33_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_34                  2 1 /Conv_135_output_0_splitncnn_0 /Sigmoid_33_output_0 /Mul_34_output_0 0=2
BinaryOp         /Add_34                  2 1 /Mul_34_output_0 /Add_33_output_0_splitncnn_0 /Add_34_output_0
Split            splitncnn_68             1 2 /Add_34_output_0 /Add_34_output_0_splitncnn_0 /Add_34_output_0_splitncnn_1
Convolution      /Conv_138                1 1 /Add_34_output_0_splitncnn_1 /Relu_68_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_139                1 1 /Relu_68_output_0 /Conv_139_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_69             1 2 /Conv_139_output_0 /Conv_139_output_0_splitncnn_0 /Conv_139_output_0_splitncnn_1
Pooling          /GlobalAveragePool_34    1 1 /Conv_139_output_0_splitncnn_1 /GlobalAveragePool_34_output_0 0=1 4=1
InnerProduct     /Conv_140                1 1 /GlobalAveragePool_34_output_0 /Relu_69_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_141                1 1 /Relu_69_output_0 /Sigmoid_34_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_35                  2 1 /Conv_139_output_0_splitncnn_0 /Sigmoid_34_output_0 /Mul_35_output_0 0=2
BinaryOp         /Add_35                  2 1 /Mul_35_output_0 /Add_34_output_0_splitncnn_0 /Add_35_output_0
Split            splitncnn_70             1 2 /Add_35_output_0 /Add_35_output_0_splitncnn_0 /Add_35_output_0_splitncnn_1
Convolution      /Conv_142                1 1 /Add_35_output_0_splitncnn_1 /Relu_70_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_143                1 1 /Relu_70_output_0 /Conv_143_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_71             1 2 /Conv_143_output_0 /Conv_143_output_0_splitncnn_0 /Conv_143_output_0_splitncnn_1
Pooling          /GlobalAveragePool_35    1 1 /Conv_143_output_0_splitncnn_1 /GlobalAveragePool_35_output_0 0=1 4=1
InnerProduct     /Conv_144                1 1 /GlobalAveragePool_35_output_0 /Relu_71_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_145                1 1 /Relu_71_output_0 /Sigmoid_35_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_36                  2 1 /Conv_143_output_0_splitncnn_0 /Sigmoid_35_output_0 /Mul_36_output_0 0=2
BinaryOp         /Add_36                  2 1 /Mul_36_output_0 /Add_35_output_0_splitncnn_0 /Add_36_output_0
Split            splitncnn_72             1 2 /Add_36_output_0 /Add_36_output_0_splitncnn_0 /Add_36_output_0_splitncnn_1
Convolution      /Conv_146                1 1 /Add_36_output_0_splitncnn_1 /Relu_72_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_147                1 1 /Relu_72_output_0 /Conv_147_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_73             1 2 /Conv_147_output_0 /Conv_147_output_0_splitncnn_0 /Conv_147_output_0_splitncnn_1
Pooling          /GlobalAveragePool_36    1 1 /Conv_147_output_0_splitncnn_1 /GlobalAveragePool_36_output_0 0=1 4=1
InnerProduct     /Conv_148                1 1 /GlobalAveragePool_36_output_0 /Relu_73_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_149                1 1 /Relu_73_output_0 /Sigmoid_36_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_37                  2 1 /Conv_147_output_0_splitncnn_0 /Sigmoid_36_output_0 /Mul_37_output_0 0=2
BinaryOp         /Add_37                  2 1 /Mul_37_output_0 /Add_36_output_0_splitncnn_0 /Add_37_output_0
Split            splitncnn_74             1 2 /Add_37_output_0 /Add_37_output_0_splitncnn_0 /Add_37_output_0_splitncnn_1
Convolution      /Conv_150                1 1 /Add_37_output_0_splitncnn_1 /Relu_74_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_151                1 1 /Relu_74_output_0 /Conv_151_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_75             1 2 /Conv_151_output_0 /Conv_151_output_0_splitncnn_0 /Conv_151_output_0_splitncnn_1
Pooling          /GlobalAveragePool_37    1 1 /Conv_151_output_0_splitncnn_1 /GlobalAveragePool_37_output_0 0=1 4=1
InnerProduct     /Conv_152                1 1 /GlobalAveragePool_37_output_0 /Relu_75_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_153                1 1 /Relu_75_output_0 /Sigmoid_37_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_38                  2 1 /Conv_151_output_0_splitncnn_0 /Sigmoid_37_output_0 /Mul_38_output_0 0=2
BinaryOp         /Add_38                  2 1 /Mul_38_output_0 /Add_37_output_0_splitncnn_0 /Add_38_output_0
Split            splitncnn_76             1 2 /Add_38_output_0 /Add_38_output_0_splitncnn_0 /Add_38_output_0_splitncnn_1
Convolution      /Conv_154                1 1 /Add_38_output_0_splitncnn_1 /Relu_76_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_155                1 1 /Relu_76_output_0 /Conv_155_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_77             1 2 /Conv_155_output_0 /Conv_155_output_0_splitncnn_0 /Conv_155_output_0_splitncnn_1
Pooling          /GlobalAveragePool_38    1 1 /Conv_155_output_0_splitncnn_1 /GlobalAveragePool_38_output_0 0=1 4=1
InnerProduct     /Conv_156                1 1 /GlobalAveragePool_38_output_0 /Relu_77_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_157                1 1 /Relu_77_output_0 /Sigmoid_38_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_39                  2 1 /Conv_155_output_0_splitncnn_0 /Sigmoid_38_output_0 /Mul_39_output_0 0=2
BinaryOp         /Add_39                  2 1 /Mul_39_output_0 /Add_38_output_0_splitncnn_0 /Add_39_output_0
Split            splitncnn_78             1 2 /Add_39_output_0 /Add_39_output_0_splitncnn_0 /Add_39_output_0_splitncnn_1
Convolution      /Conv_158                1 1 /Add_39_output_0_splitncnn_1 /Relu_78_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_159                1 1 /Relu_78_output_0 /Conv_159_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_79             1 2 /Conv_159_output_0 /Conv_159_output_0_splitncnn_0 /Conv_159_output_0_splitncnn_1
Pooling          /GlobalAveragePool_39    1 1 /Conv_159_output_0_splitncnn_1 /GlobalAveragePool_39_output_0 0=1 4=1
InnerProduct     /Conv_160                1 1 /GlobalAveragePool_39_output_0 /Relu_79_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_161                1 1 /Relu_79_output_0 /Sigmoid_39_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_40                  2 1 /Conv_159_output_0_splitncnn_0 /Sigmoid_39_output_0 /Mul_40_output_0 0=2
BinaryOp         /Add_40                  2 1 /Mul_40_output_0 /Add_39_output_0_splitncnn_0 /Add_40_output_0
Convolution      /Conv_162                1 1 /Add_40_output_0 /Conv_162_output_0 0=64 1=3 4=1 5=1 6=36864
BinaryOp         /Add_41                  2 1 /Conv_162_output_0 /Add_20_output_0_splitncnn_0 /Add_41_output_0
Split            splitncnn_80             1 3 /Add_41_output_0 /Add_41_output_0_splitncnn_0 /Add_41_output_0_splitncnn_1 /Add_41_output_0_splitncnn_2
Convolution      /Conv_163                1 1 /Add_41_output_0_splitncnn_2 /Relu_80_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_164                1 1 /Relu_80_output_0 /Conv_164_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_81             1 2 /Conv_164_output_0 /Conv_164_output_0_splitncnn_0 /Conv_164_output_0_splitncnn_1
Pooling          /GlobalAveragePool_40    1 1 /Conv_164_output_0_splitncnn_1 /GlobalAveragePool_40_output_0 0=1 4=1
InnerProduct     /Conv_165                1 1 /GlobalAveragePool_40_output_0 /Relu_81_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_166                1 1 /Relu_81_output_0 /Sigmoid_40_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_41                  2 1 /Conv_164_output_0_splitncnn_0 /Sigmoid_40_output_0 /Mul_41_output_0 0=2
BinaryOp         /Add_42                  2 1 /Mul_41_output_0 /Add_41_output_0_splitncnn_1 /Add_42_output_0
Split            splitncnn_82             1 2 /Add_42_output_0 /Add_42_output_0_splitncnn_0 /Add_42_output_0_splitncnn_1
Convolution      /Conv_167                1 1 /Add_42_output_0_splitncnn_1 /Relu_82_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_168                1 1 /Relu_82_output_0 /Conv_168_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_83             1 2 /Conv_168_output_0 /Conv_168_output_0_splitncnn_0 /Conv_168_output_0_splitncnn_1
Pooling          /GlobalAveragePool_41    1 1 /Conv_168_output_0_splitncnn_1 /GlobalAveragePool_41_output_0 0=1 4=1
InnerProduct     /Conv_169                1 1 /GlobalAveragePool_41_output_0 /Relu_83_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_170                1 1 /Relu_83_output_0 /Sigmoid_41_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_42                  2 1 /Conv_168_output_0_splitncnn_0 /Sigmoid_41_output_0 /Mul_42_output_0 0=2
BinaryOp         /Add_43                  2 1 /Mul_42_output_0 /Add_42_output_0_splitncnn_0 /Add_43_output_0
Split            splitncnn_84             1 2 /Add_43_output_0 /Add_43_output_0_splitncnn_0 /Add_43_output_0_splitncnn_1
Convolution      /Conv_171                1 1 /Add_43_output_0_splitncnn_1 /Relu_84_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_172                1 1 /Relu_84_output_0 /Conv_172_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_85             1 2 /Conv_172_output_0 /Conv_172_output_0_splitncnn_0 /Conv_172_output_0_splitncnn_1
Pooling          /GlobalAveragePool_42    1 1 /Conv_172_output_0_splitncnn_1 /GlobalAveragePool_42_output_0 0=1 4=1
InnerProduct     /Conv_173                1 1 /GlobalAveragePool_42_output_0 /Relu_85_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_174                1 1 /Relu_85_output_0 /Sigmoid_42_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_43                  2 1 /Conv_172_output_0_splitncnn_0 /Sigmoid_42_output_0 /Mul_43_output_0 0=2
BinaryOp         /Add_44                  2 1 /Mul_43_output_0 /Add_43_output_0_splitncnn_0 /Add_44_output_0
Split            splitncnn_86             1 2 /Add_44_output_0 /Add_44_output_0_splitncnn_0 /Add_44_output_0_splitncnn_1
Convolution      /Conv_175                1 1 /Add_44_output_0_splitncnn_1 /Relu_86_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_176                1 1 /Relu_86_output_0 /Conv_176_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_87             1 2 /Conv_176_output_0 /Conv_176_output_0_splitncnn_0 /Conv_176_output_0_splitncnn_1
Pooling          /GlobalAveragePool_43    1 1 /Conv_176_output_0_splitncnn_1 /GlobalAveragePool_43_output_0 0=1 4=1
InnerProduct     /Conv_177                1 1 /GlobalAveragePool_43_output_0 /Relu_87_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_178                1 1 /Relu_87_output_0 /Sigmoid_43_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_44                  2 1 /Conv_176_output_0_splitncnn_0 /Sigmoid_43_output_0 /Mul_44_output_0 0=2
BinaryOp         /Add_45                  2 1 /Mul_44_output_0 /Add_44_output_0_splitncnn_0 /Add_45_output_0
Split            splitncnn_88             1 2 /Add_45_output_0 /Add_45_output_0_splitncnn_0 /Add_45_output_0_splitncnn_1
Convolution      /Conv_179                1 1 /Add_45_output_0_splitncnn_1 /Relu_88_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_180                1 1 /Relu_88_output_0 /Conv_180_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_89             1 2 /Conv_180_output_0 /Conv_180_output_0_splitncnn_0 /Conv_180_output_0_splitncnn_1
Pooling          /GlobalAveragePool_44    1 1 /Conv_180_output_0_splitncnn_1 /GlobalAveragePool_44_output_0 0=1 4=1
InnerProduct     /Conv_181                1 1 /GlobalAveragePool_44_output_0 /Relu_89_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_182                1 1 /Relu_89_output_0 /Sigmoid_44_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_45                  2 1 /Conv_180_output_0_splitncnn_0 /Sigmoid_44_output_0 /Mul_45_output_0 0=2
BinaryOp         /Add_46                  2 1 /Mul_45_output_0 /Add_45_output_0_splitncnn_0 /Add_46_output_0
Split            splitncnn_90             1 2 /Add_46_output_0 /Add_46_output_0_splitncnn_0 /Add_46_output_0_splitncnn_1
Convolution      /Conv_183                1 1 /Add_46_output_0_splitncnn_1 /Relu_90_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_184                1 1 /Relu_90_output_0 /Conv_184_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_91             1 2 /Conv_184_output_0 /Conv_184_output_0_splitncnn_0 /Conv_184_output_0_splitncnn_1
Pooling          /GlobalAveragePool_45    1 1 /Conv_184_output_0_splitncnn_1 /GlobalAveragePool_45_output_0 0=1 4=1
InnerProduct     /Conv_185                1 1 /GlobalAveragePool_45_output_0 /Relu_91_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_186                1 1 /Relu_91_output_0 /Sigmoid_45_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_46                  2 1 /Conv_184_output_0_splitncnn_0 /Sigmoid_45_output_0 /Mul_46_output_0 0=2
BinaryOp         /Add_47                  2 1 /Mul_46_output_0 /Add_46_output_0_splitncnn_0 /Add_47_output_0
Split            splitncnn_92             1 2 /Add_47_output_0 /Add_47_output_0_splitncnn_0 /Add_47_output_0_splitncnn_1
Convolution      /Conv_187                1 1 /Add_47_output_0_splitncnn_1 /Relu_92_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_188                1 1 /Relu_92_output_0 /Conv_188_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_93             1 2 /Conv_188_output_0 /Conv_188_output_0_splitncnn_0 /Conv_188_output_0_splitncnn_1
Pooling          /GlobalAveragePool_46    1 1 /Conv_188_output_0_splitncnn_1 /GlobalAveragePool_46_output_0 0=1 4=1
InnerProduct     /Conv_189                1 1 /GlobalAveragePool_46_output_0 /Relu_93_output_0 0=4 1=1 2=256 9=1
InnerProduct     /Conv_190                1 1 /Relu_93_output_0 /Sigmoid_46_output_0 0=64 1=1 2=256 9=4
BinaryOp         /Mul_47                  2 1 /Conv_188_output_0_splitncnn_0 /Sigmoid_46_output_0 /Mul_47_output_0 0=2
BinaryOp         /Add_48                  2 1 /Mul_47_output_0 /Add_47_output_0_splitncnn_0 /Add_48_output_0
Split            splitncnn_94             1 2 /Add_48_output_0 /Add_48_output_0_splitncnn_0 /Add_48_output_0_splitncnn_1
Convolution      /Conv_191                1 1 /Add_48_output_0_splitncnn_1 /Relu_94_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution      /Conv_192                1 1 /Relu_94_output_0 /Conv_192_output_0 0=64 1=3 4=1 5=1 6=36864
Split            splitncnn_95             1 2 /Conv_192_output_0 /Conv_192_output_0_splitncnn_0 /Conv_192_output_0_splitncnn_1
Pooling          /GlobalAveragePool_47    1 1 /Conv_192_output_0_splitncnn_1 /GlobalAveragePool_47_output_0 0=1 4=1
InnerProduct     /Conv_193                1 1 /GlobalAveragePool_47_output_0 /Relu_95_output_0 0=4 1=1 2=256 9=1
